let a = +prompt('Введіть перше число')
let b = +prompt('Введіть друге число')

if(a > b){
    if(a % b === 0){
        alert('Перше число націло ділиться на друге')
    }
    else if(a % b !== 0){
        alert('Перше число націло не ділиться на друге')
    }
}
else if(a < b){
    if(b % a === 0){
        alert('Друге число націло ділиться на перше')
    }
    else if(b % a !== 0){
        alert('Перше число націло не ділиться на друге')
    }
}
else{
    alert('Ваші числа однакові, тому вони націло діляться одне на одне')
}